varigit/freertos-variscite/boards/dart_mx95/cmsis_driver_examples/lpi2c/int_b2b_transfer/slave/cm7/pin_mux.h
/*
 * Copyright 2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"
#include "hal_pinctrl.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: undefined[cm33] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C4_InitPins(void);                                /*!< Function assigned for the core: undefined[cm33] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C4_DeinitPins(void);                              /*!< Function assigned for the core: undefined[cm33] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
